<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки для сброса пароля
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки являются стандартными и соответствуют причинам,
    | которые предоставляет брокер паролей, когда попытка обновления пароля
    | не удалась, например, из-за недействительного токена или недействительного нового пароля.
    |
    */

    'reset' => 'Ваш пароль был сброшен!',
    'sent' => 'Мы отправили вам ссылку для сброса пароля на электронную почту!',
    'throttled' => 'Пожалуйста, подождите перед повторной попыткой.',
    'token' => 'Этот токен для сброса пароля недействителен.',
    'user' => 'Мы не можем найти пользователя с таким адресом электронной почты.',

];
