<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Wireless Sensors Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to translate names and units of wireless sensors
    |
    */

    'title' => 'Беспроводное соединение',
    'ap-count' => [
        'short' => 'Точки доступа',
        'long' => 'Количество точек доступа',
        'unit' => '',
    ],
    'clients' => [
        'short' => 'Клиенты',
        'long' => 'Количество клиентов',
        'unit' => '',
    ],
    'capacity' => [
        'short' => 'Пропускная способность',
        'long' => 'Пропускная способность',
        'unit' => '%',
    ],
    'ccq' => [
        'short' => 'CCQ',
        'long' => 'Качество соединения клиента',
        'unit' => '%',
    ],
    'errors' => [
        'short' => 'Ошибки',
        'long' => 'Количество ошибок',
        'unit' => '',
    ],
    'error-ratio' => [
        'short' => 'Соотношение ошибок',
        'long' => 'Соотношение ошибок бит/пакетов',
        'unit' => '%',
    ],
    'error-rate' => [
        'short' => 'BER',
        'long' => 'Битовая ошибка',
        'unit' => 'бит/с',
    ],
    'frequency' => [
        'short' => 'Частота',
        'long' => 'Частота',
        'unit' => 'МГц',
    ],
    'distance' => [
        'short' => 'Расстояние',
        'long' => 'Расстояние',
        'unit' => 'м',
    ],
    'mse' => [
        'short' => 'MSE',
        'long' => 'Среднеквадратическая ошибка',
        'unit' => 'дБ',
    ],
    'noise-floor' => [
        'short' => 'Уровень шума',
        'long' => 'Уровень шума',
        'unit' => 'дБм',
    ],
    'power' => [
        'short' => 'Мощность/Сигнал',
        'long' => 'Мощность передатчика/сигнал',
        'unit' => 'дБм',
    ],
    'quality' => [
        'short' => 'Качество',
        'long' => 'Качество',
        'unit' => '%',
    ],
    'rate' => [
        'short' => 'Скорость',
        'long' => 'Скорость передачи/приема',
        'unit' => 'бит/с',
    ],
    'rssi' => [
        'short' => 'RSSI',
        'long' => 'Индикатор мощности принимаемого сигнала',
        'unit' => 'дБм',
    ],
    'snr' => [
        'short' => 'SNR',
        'long' => 'Соотношение сигнал/шум',
        'unit' => 'дБ',
    ],
    'sinr' => [
        'short' => 'SINR',
        'long' => 'Соотношение сигнал/интерференция+шум',
        'unit' => 'дБ',
    ],
    'rsrq' => [
        'short' => 'RSRQ',
        'long' => 'Качество принимаемого опорного сигнала',
        'unit' => 'дБ',
    ],
    'rsrp' => [
        'short' => 'RSRP',
        'long' => 'Мощность принимаемых опорных сигналов',
        'unit' => 'дБм',
    ],
    'ssr' => [
        'short' => 'SSR',
        'long' => 'Соотношение сигнал/шум',
        'unit' => 'дБ',
    ],
    'utilization' => [
        'short' => 'Использование',
        'long' => 'Использование',
        'unit' => '%',
    ],
    'xpi' => [
        'short' => 'XPI',
        'long' => 'Межполярное вмешательство',
        'unit' => 'дБ',
    ],
    'cell' => [
        'short' => 'Ячейка',
        'long' => 'Ячейка',
        'unit' => '',
    ],
    'channel' => [
        'short' => 'Канал',
        'long' => 'Канал',
        'unit' => '',
    ],
];