<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки для беспроводных датчиков
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки используются для перевода названий и единиц измерения беспроводных датчиков
    |
    */

    'title' => 'Беспроводной',
    'ap-count' => [
        'short' => 'Точки доступа',
        'long' => 'Количество точек доступа',
        'unit' => '',
    ],
    'clients' => [
        'short' => 'Клиенты',
        'long' => 'Количество клиентов',
        'unit' => '',
    ],
    'capacity' => [
        'short' => 'Вместимость',
        'long' => 'Вместимость',
        'unit' => '%',
    ],
    'ccq' => [
        'short' => 'CCQ',
        'long' => 'Качество соединения клиента',
        'unit' => '%',
    ],
    'errors' => [
        'short' => 'Ошибки',
        'long' => 'Количество ошибок',
        'unit' => '',
    ],
    'error-ratio' => [
        'short' => 'Коэффициент ошибок',
        'long' => 'Коэффициент бит/пакетных ошибок',
        'unit' => '%',
    ],
    'error-rate' => [
        'short' => 'BER',
        'long' => 'Коэффициент битовых ошибок',
        'unit' => 'bps',
    ],
    'frequency' => [
        'short' => 'Частота',
        'long' => 'Частота',
        'unit' => 'МГц',
    ],
    'distance' => [
        'short' => 'Расстояние',
        'long' => 'Расстояние',
        'unit' => 'м',
    ],
    'mse' => [
        'short' => 'MSE',
        'long' => 'Среднеквадратичная ошибка',
        'unit' => 'дБ',
    ],
    'noise-floor' => [
        'short' => 'Шумовой уровень',
        'long' => 'Шумовой уровень',
        'unit' => 'дБм',
    ],
    'power' => [
        'short' => 'Мощность/Сигнал',
        'long' => 'TX/RX мощность или сигнал',
        'unit' => 'дБм',
    ],
    'quality' => [
        'short' => 'Качество',
        'long' => 'Качество',
        'unit' => '%',
    ],
    'rate' => [
        'short' => 'Скорость',
        'long' => 'TX/RX скорость',
        'unit' => 'bps',
    ],
    'rssi' => [
        'short' => 'RSSI',
        'long' => 'Индикатор уровня принимаемого сигнала',
        'unit' => 'дБм',
    ],
    'snr' => [
        'short' => 'SNR',
        'long' => 'Отношение сигнал/шум',
        'unit' => 'дБ',
    ],
    'sinr' => [
        'short' => 'SINR',
        'long' => 'Отношение сигнал/интерференция+шум',
        'unit' => 'дБ',
    ],
    'rsrq' => [
        'short' => 'RSRQ',
        'long' => 'Качество принимаемого референсного сигнала',
        'unit' => 'дБ',
    ],
    'rsrp' => [
        'short' => 'RSRP',
        'long' => 'Мощность принимаемых референсных сигналов',
        'unit' => 'дБм',
    ],
    'ssr' => [
        'short' => 'SSR',
        'long' => 'Коэффициент мощности сигнала',
        'unit' => 'дБ',
    ],
    'utilization' => [
        'short' => 'Использование',
        'long' => 'Использование',
        'unit' => '%',
    ],
    'xpi' => [
        'short' => 'XPI',
        'long' => 'Перекрестная поляризационная интерференция',
        'unit' => 'дБ',
    ],
    'cell' => [
        'short' => 'Ячейка',
        'long' => 'Ячейка',
        'unit' => '',
    ],
    'channel' => [
        'short' => 'Канал',
        'long' => 'Канал',
        'unit' => '',
    ],
];
