<?php

return [
    'settings' => [
        'settings' => [
            'poller_groups' => [
                'description' => 'მინიჭებული ჯგუფები',
                'help' => 'ეს კვანძი, მხოლოდ, იმ მოწყობილობებზე იმოქმედებს, რომლებიც ამ მოთხოვნის ჯგუფებშია.',
            ],
            'poller_enabled' => [
                'description' => 'მომთხოვნი ჩართულია',
                'help' => 'მომთხოვნი დამხმარე პროცესების ჩართვა ამ კვანძზე.',
            ],
            'poller_workers' => [
                'description' => 'მომთხოვნი დამხმარე პროცესები',
                'help' => 'ამ კვანძზე გასაშვები დამხმარე მომთხოვნი დამხმარე პროცესები რაოდენობა.',
            ],
            'poller_frequency' => [
                'description' => 'მომთხოვნის სიხშირე (ყურადღებით!)',
                'help' => 'რამდენად ხშირად მოხდება მონაცემების მოთხოვნა მოწყობილობებიდან ამ კვანძზე. ყურადღება! ამის სეცვლა rrd ფაილების გასწორების გარეშე გრაფიკებს გააფუჭებს! მეტი ინფორმაციისთვის იხილეთ დოკუმენტაცია.',
            ],
            'poller_down_retry' => [
                'description' => 'გამორთული მოწყობილობების თავიდან ცდები',
                'help' => 'თუ მოწყობილობა ხელმიუწვდომელი გახდება, მომთხოვნი ამ რაოდენობაჯერ სცდის თავიდან დაკავშირებას ამ კვანძიდან. ეს დროა, რომელსაც მოვიცდით თავიდან ცდამდე.',
            ],
            'discovery_enabled' => [
                'description' => 'აღმოჩენა ჩართულია',
                'help' => 'აღმომჩენი დამხმარე პროცესების ჩართვა ამ კვანძზე.',
            ],
            'discovery_workers' => [
                'description' => 'აღმოჩენის დამხმარე პროცესები',
                'help' => 'რამდენი აღმომჩენი პროცესი გაეშვება ამ კვანძზე. დიდი მნიშვნელობები სერვერის გადატვირთვას გამოიწვევს.',
            ],
            'discovery_frequency' => [
                'description' => 'აღმოჩენის სიხშირე',
                'help' => 'რამდენჯად ხშირად გაეშვება ახალი მოწყობილობების აღმოჩენა ამ კვანძზე. ნაგულისხმევი მნიშვნელობაა 4-ჯერ დღეში.',
            ],
            'services_enabled' => [
                'description' => 'სერვისები ჩართულია',
                'help' => 'სერვისული დამხმარე პროცესების ჩართვა ამ კვანძზე.',
            ],
            'services_workers' => [
                'description' => 'სერვისული დამხმარე პროცესები',
                'help' => 'სერვისული დამხმარე პროცესების რაოდენობა ამ კვანძზე.',
            ],
            'services_frequency' => [
                'description' => 'სერვისის სიხშირე',
                'help' => 'რამდენად ხშირად გაეშვება სერვისები ამ კვანძზე. უნდა ემთხვეოდეს მომთხოვნის სიხშირეს.',
            ],
            'billing_enabled' => [
                'description' => 'ბილინგი ჩართულია',
                'help' => 'ბილინგის დამხმარე პროცესების ჩართვა ამ კვანძზე.',
            ],
            'billing_frequency' => [
                'description' => 'Billing Frequency',
                'help' => 'რამდენად ხშირად მოხდება ბილინგის მონაცემების მოგროვება ამ კვანძზე.',
            ],
            'billing_calculate_frequency' => [
                'description' => 'ბილინგის გამოთვლის სიხშირე',
                'help' => 'რამდენად ხშირად მოხდება ბილინგის გამოთვლა ამ კვანძზე.',
            ],
            'alerting_enabled' => [
                'description' => 'განგაშები ჩართულია',
                'help' => 'განგაშების დამხმარე პროცესების ჩართვა ამ კვანძზე.',
            ],
            'alerting_frequency' => [
                'description' => 'განგაშების სიხშირე',
                'help' => 'რამდენად ხშირად მოხდება განგაშის წესების შემოწმება ამ კვანძზე. მონაცემები, მხოლოდ, მომთხოვნის სიხშირის მიხედვით განახლდება.',
            ],
            'ping_enabled' => [
                'description' => 'სწრაფი პინგი ჩართულია',
                'help' => 'სწრაფი პინგი უბრალოდ პინგავს მოწყობილობებს, რომ შეამოწმოს, ჩართულია თუ არა ისინი',
            ],
            'ping_frequency' => [
                'description' => 'პინგის სიხშირე',
                'help' => 'რამდენად ხშირად შემოწმდება პინგი ამ კვანძზე. ფრთხილად! თუ ამას შეცვლით, ასევე მოგიწევთ სხვა ცვლილებების შეტანაც. იხილეთ სწრაფი პინგის დოკუმენტაცია.',
            ],
            'update_enabled' => [
                'description' => 'დღიური რემონტი ჩართულია',
                'help' => 'დღიური რემონტის სკრიპტის daily.sh გაშვება და დისპეჩერის სერვისის გადატვირთვა ამის შემდეგ.',
            ],
            'update_frequency' => [
                'description' => 'რემონტის სიხშირე',
                'help' => 'რამდენად ხშირად გაეშვება დღიური რემონტი ამ კვანძზე. ნაგულისხმევი მნიშვნელობაა ერთხელ დღეში. რეკომენდებულია, არ შეცვალოთ ეს.',
            ],
            'loglevel' => [
                'description' => 'ჟურნალის დონე',
                'help' => 'დისპეჩერის სერვისის ჟურნალის დონე.',
            ],
            'watchdog_enabled' => [
                'description' => 'Watchdog ჩართულია',
                'help' => 'Watchdog უყურებს ჟურნალის ფაილს და გადატვირთავს სერვისს, თუ ის არ განახლდება',
            ],
            'watchdog_log' => [
                'description' => 'ჟურნალის ფაილი საყურებლად',
                'help' => 'LibreNMS-ის ჟურნალის ფაილი.',
            ],
        ],
        'units' => [
            'seconds' => 'წამი',
            'workers' => 'დამხმარე პროცესი',
        ],
    ],
];
